# St7SetBeamSpringAspect

Sets the aspect ratio displayed for spring elements.

long St7SetBeamSpringAspect(long uID, long Aspect)

Input Parameters

uID

Strand7 model file ID.

Aspect

The spring element aspect ratio in the range kMinSpringAspect to kMaxSpringAspect.